result/virtual-thread/performance.txt
wrk -t8 -c10000 -d600s --latency --timeout 5s http://10.152.0.2:8080/benchmark/delay/1000
wrk -t8 -c10000 -d600s --latency --timeout 5s http://10.152.0.2:8080/benchmark/delay/500
wrk -t8 -c10000 -d600s --latency --timeout 5s http://10.152.0.2:8080/benchmark/delay/200
wrk -t8 -c10000 -d600s --latency --timeout 5s http://10.152.0.2:8080/benchmark/delay/100


Running 10m test @ http://10.152.0.2:8080/benchmark/delay/1000
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00s    62.10ms   4.84s    99.51%
    Req/Sec     1.03k   428.48     3.96k    72.75%
  Latency Distribution
     50%    1.00s
     75%    1.00s
     90%    1.00s
     99%    1.01s
  4868271 requests in 10.00m, 506.80MB read
  Socket errors: connect 0, read 2953, write 4079, timeout 3430
Requests/sec:   8112.82
Transfer/sec:    864.84KB


Running 10m test @ http://10.152.0.2:8080/benchmark/delay/500
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   504.93ms   48.88ms   4.40s    99.00%
    Req/Sec     2.04k   689.10     6.18k    69.08%
  Latency Distribution
     50%  501.20ms
     75%  503.04ms
     90%  506.63ms
     99%  553.93ms
  9726543 requests in 10.00m, 0.98GB read
  Socket errors: connect 0, read 1960, write 5034, timeout 1273
Requests/sec:  16208.57
Transfer/sec:      1.67MB


Running 10m test @ http://10.152.0.2:8080/benchmark/delay/200
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   242.88ms  100.91ms   4.99s    95.28%
    Req/Sec     4.32k     1.01k    8.04k    69.79%
  Latency Distribution
     50%  218.54ms
     75%  248.66ms
     90%  297.18ms
     99%  538.40ms
  20625809 requests in 10.00m, 2.08GB read
  Socket errors: connect 0, read 5112, write 2594, timeout 3505
Requests/sec:  34370.87
Transfer/sec:      3.55MB


Running 10m test @ http://10.152.0.2:8080/benchmark/delay/100
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   245.57ms  184.40ms   4.99s    92.68%
    Req/Sec     4.59k     1.17k    9.38k    67.95%
  Latency Distribution
     50%  198.95ms
     75%  243.58ms
     90%  343.02ms
     99%    1.06s
  21939140 requests in 10.00m, 2.21GB read
  Socket errors: connect 0, read 5296, write 2184, timeout 2274
Requests/sec:  36559.70
Transfer/sec:      3.77MB