result/virtual-thread/throughput-latency.txt
# Warm-up: 8 threads, 10k connections, 2 minutes
wrk -t8 -c10000 -d120s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/100 | tee performance.txt
sleep 15
# Pressure: 8 threads, 10k connections, 10 minutes, API dealy: 0.1 s, 0.2 s, 0.5 s
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/100 | tee -a performance.txt
sleep 15
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/200 | tee -a performance.txt
sleep 15
wrk -t8 -c10000 -d600s --latency --timeout 10s http://10.152.0.2:8080/benchmark/delay/500 | tee -a performance.txt
Running 2m test @ http://10.152.0.2:8080/benchmark/delay/100
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   492.72ms  612.86ms   6.80s    85.57%
    Req/Sec     4.22k     1.26k    8.36k    73.56%
  Latency Distribution
     50%  208.71ms
     75%  504.08ms
     90%    1.43s
     99%    2.72s
  4005113 requests in 2.00m, 413.15MB read
Requests/sec:  33352.05
Transfer/sec:      3.44MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/100
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   479.67ms  607.76ms   6.54s    85.60%
    Req/Sec     4.43k     1.04k    8.95k    69.78%
  Latency Distribution
     50%  202.77ms
     75%  450.11ms
     90%    1.42s
     99%    2.66s
  21177799 requests in 10.00m, 2.13GB read
Requests/sec:  35290.82
Transfer/sec:      3.64MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/200
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   293.71ms  127.37ms   2.37s    91.80%
    Req/Sec     4.41k     1.02k    9.44k    67.17%
  Latency Distribution
     50%  256.44ms
     75%  304.72ms
     90%  384.67ms
     99%  881.20ms
  21079433 requests in 10.00m, 2.12GB read
Requests/sec:  35126.44
Transfer/sec:      3.62MB
Running 10m test @ http://10.152.0.2:8080/benchmark/delay/500
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   505.42ms   15.29ms   1.14s    95.10%
    Req/Sec     2.49k     0.88k    6.90k    68.42%
  Latency Distribution
     50%  501.88ms
     75%  504.74ms
     90%  510.91ms
     99%  559.64ms
  11860822 requests in 10.00m, 1.19GB read
Requests/sec:  19764.87
Transfer/sec:      2.04MB